ab_test_result_20250323065807.log
Starting Apache Benchmark test...
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100000 requests
Completed 200000 requests
Completed 300000 requests
Completed 400000 requests
Completed 500000 requests
Completed 600000 requests
Completed 700000 requests
Completed 800000 requests
Completed 900000 requests
Completed 1000000 requests
Finished 1000000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      1000
Time taken for tests:   46.579 seconds
Complete requests:      1000000
Failed requests:        0
Non-2xx responses:      1000000
Keep-Alive requests:    1000000
Total transferred:      106000000 bytes
HTML transferred:       0 bytes
Requests per second:    21469.07 [#/sec] (mean)
Time per request:       46.579 [ms] (mean)
Time per request:       0.047 [ms] (mean, across all concurrent requests)
Transfer rate:          2222.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0      39
Processing:     2   46  28.1     34     558
Waiting:        1   46  28.1     34     558
Total:          2   47  28.3     34     580

Percentage of the requests served within a certain time (ms)
  50%     34
  66%     53
  75%     63
  80%     68
  90%     82
  95%     99
  98%    114
  99%    135
 100%    580 (longest request)